import * as WebBrowser from 'expo-web-browser';
import React from 'react';
import {
  StyleSheet,
  View,
  SafeAreaView,
  ScrollView,
  Text,
} from 'react-native';

import { AppLoading } from 'expo';
import * as Font from 'expo-font';

import Colors, { themes } from '../../constants/Colors.js';

import Loader from '../../components/ui/Loader.js';
import UiHeader from '../../components/ui/header/Header.js';
import UiClearCard from '../../components/ui/cards/ClearAndroidCard.js';

import { Locale, getLang, getTheme } from '../../i18n/locale.js';

export default class PoliticsScreen extends React.Component {

  state = {
    fontsLoaded: false,
    lang: "kz",
    loginProgress: false,
    nightEnabled: false,
  }

  static navigationOptions = {
    header: null,
  };

  componentDidMount = async () => {
    await Font.loadAsync({
      'Roboto-Regular': require('../../assets/fonts/Roboto-Regular.ttf'),
      'Roboto-Medium': require('../../assets/fonts/Roboto-Medium.ttf'),
    }).then(() => this.setState({ fontsLoaded: true }));

    getLang().then((res) => this.setState({ lang: res }));
    this.changeTheme();
    this.props.navigation.addListener('willFocus', this.load);
    //this.getRSS();
  }

  load = () => {
    getLang().then((res) => this.setState({ lang: res }));
    this.changeTheme();
    //RSS
  }

  changeTheme() {
    getTheme().then((res) => {
      //console.log("theme", res);
      this.setState({ selectedTheme: res });
    });
  }

  render() {
    const { navigate } = this.props.navigation;
    if (!this.state.fontsLoaded) {
      return <AppLoading />
    }

    return (
      <View style={[
        styles.container,
        this.state.selectedTheme == 'night' ? { backgroundColor: themes.night.uiBg } : { backgroundColor: themes.normal.uiBg },
      ]}>

        <UiHeader
          selectedTheme={this.state.selectedTheme}
          pressRight={() => navigate('Live')}
          btnLeft='back'
          pressLeft={() => navigate('AboutApp')}
        />

        <SafeAreaView style={styles.safeArea} forceInset={{ top: 'never' }}>
          <ScrollView style={styles.content}>
            {this.state.lang == "ru" ?
            <Text style={[
              styles.contentText,
              this.state.selectedTheme == 'night' ? { color: themes.night.uiText } : { color: themes.normal.uiText },
            ]}>
              Акционерное общество «Агентство «Хабар»  (далее-Администрация) является законным правообладателем мобильного приложения «Хабар 24» (далее - Приложение) и предоставляет право пользованиям  данным Приложением любому Пользователю.
              Настоящая Политика конфиденциальности Приложения (далее - Политика) действует в отношении всей информации, которую Администрация   может получить о Пользователе во время использования им Приложением.
              Использование Приложения означает безоговорочное согласие Пользователя с настоящей Политикой и указанными в ней условиями обработки его персональной информации. В случае несогласия с  условиями Политики Пользователь не вправе  ее  использовать.
              Администрация  признает важность конфиденциальности личной информации Пользователя Приложения. Данная страница содержит сведения о том, какую информацию Администрация   получает и собирает, когда Пользователь пользуется Приложением. Использование Пользователем Приложения автоматически подтверждает ознакомление и согласие с данной Политикой. Весь объем личной информации, предоставляемый сверх требуемого для достижения целей Приложения, предоставляется Пользователем добровольно, по своему усмотрению.
              {"\n"}
              {"\n"}1. Определение терминов
              {"\n"}1.1. В настоящей Политике используются следующие термины:
              {"\n"}1.1.1. Администрация приложения/Администрация - акционерное общество «Агентство «Хабар»  в лице  уполномоченных работников на управление Приложением, которые организуют и (или) осуществляет обработку персональных данных, а также определяют цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.
              {"\n"}1.1.2. Персональные данные - любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу или организации (субъекту персональных данных).
              {"\n"}1.1.3. Обработка персональных данных - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.
              {"\n"}1.1.4. Конфиденциальность персональных данных - обязательное для соблюдения Администрацией или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.
              {"\n"}1.1.5. Пользователь – физическое или юридическое лицо, использующие  Приложение по его назначению
              {"\n"}
              {"\n"}2. Общие положения
              {"\n"}2.1. Настоящая Политика является  документом и определяют порядок обработки и защиты информации физических и юридических лиц,  пользующихся Приложением и его сервисами.
              {"\n"}2.2. Целью настоящей Политики  является обеспечение надлежащей защиты информации о Пользователях, в том числе их персональных данных, от несанкционированного доступа и разглашения.
              {"\n"}2.3. Отношения, связанные со сбором, хранением, распространением и защитой информации о Пользователях Приложения, регулируются настоящей Политикой, иными правилами, установленными Администрацией Приложения и законодательством Республики Казахстан.
              {"\n"}2.4. Настоящая Политика распространяется только на Приложение и на информацию, собираемую посредством Приложения. Политика не распространяется на какие либо иные  приложения и не применима к веб-приложениям третьих лиц, с которых могут делаться ссылки на Приложение.
              {"\n"}
              {"\n"}3. Условия использования Приложения
              {"\n"}3.1. Предоставляя возможность использования Приложением и его сервисами, Администрация Приложения, действуя разумно и добросовестно, считает, что Пользователь:
              обладает всеми необходимыми правами, позволяющими ему осуществлять использование настоящего Приложения;
              указывает достоверную информацию о себе в объемах, необходимых для использования Приложения и его сервисами;
              выражает свое согласие с Политикой и принимает на себя указанные права и обязанности.
              {"\n"}3.2. Администрация Приложения не проверяет достоверность получаемой (собираемой) информации о Пользователях, за исключением случаев, когда такая проверка необходима в целях исполнения Администрацией Приложения обязательств перед Пользователями.
              {"\n"}
              {"\n"}4. Цели обработки информации
              {"\n"}4.1. Приложение собирает и хранит только те персональные данные, которые необходимы для предоставления сервисов, входящих в состав Приложения.
              {"\n"}4.2. Персональную информацию Пользователя Приложения Администрация может использовать в следующих целях:
              {"\n"}4.2.1. идентификации стороны в рамках использования Приложения;
              {"\n"}4.2.2. предоставления Пользователю персонализированных сервисов;
              {"\n"}4.2.3. связи с Пользователем, в том числе, направление уведомлений, запросов и информации, касающихся использования сервисов, оказания услуг, а также обработки запросов и заявок от Пользователя;
              {"\n"}4.2.4. улучшения качества Приложения, удобства его использования, разработки новых сервисов и услуг;
              {"\n"}4.2.5. проведения статистических и иных исследований на основе обезличенных данных.
              {"\n"}
              {"\n"}5. Состав информации о Пользователе
              {"\n"}5.1. Информация, необходимая для идентификации Пользователя.
              В целях идентификации Пользователя и осуществления коммуникации Администрация Приложения использует номер мобильного телефона Пользователя.
              {"\n"}5.2. Иная информация о Пользователях, обрабатываемая Администрацией Приложения. Администрация Приложения обрабатывает также иную информацию о Пользователях, которая включает в себя:
              {"\n"}5.2.1. информацию, полученную в результате действий Пользователя на Приложении. Данная информация о Пользователе может быть доступна исключительно самому Пользователю, а также Администрации Приложения, за исключением случаев участия Пользователя в рейтинге Пользователей.
              {"\n"}
              {"\n"}6. Обработка персональных данных Пользователей
              {"\n"}6.1. Обработка персональных данных осуществляется на основе принципов:
              {"\n"}1) законности целей и способов обработки персональных данных;
              {"\n"}2) добросовестности;
              {"\n"}3) соответствия целей обработки персональных данных целям, заранее определенным и заявленным при сборе персональных данных, а также полномочиям Администрации Приложения;
              {"\n"}4) соответствия объема и характера обрабатываемых персональных данных, способов обработки персональных данных целям обработки персональных данных.
              {"\n"}6.2. Хранение и использование персональных данных
              Персональные данные Пользователей хранятся исключительно на электронных носителях и обрабатываются с использованием автоматизированных систем, за исключением случаев, когда неавтоматизированная обработка персональных данных необходима в связи с исполнением требований законодательства Республики Казахстан.
              {"\n"}6.3. Передача персональных данных
              Персональные данные Пользователей не передаются каким-либо третьим лицам, за исключением случаев, прямо предусмотренных законодательством Республики Казахстан и настоящей Политикой.
              {"\n"}6.4. Уничтожение персональных данных
              Персональные данные Пользователя уничтожаются при:
              {"\n"}1) удалении Администрацией Приложения персональных данных Пользователя по требованию Пользователя;
              {"\n"}2) удалении Администрацией Приложения профиля Пользователя.
              {"\n"}
              {"\n"}7. Права и обязанности Пользователей
              {"\n"}7.1. Используя ресурсы и сервисы Приложения, Пользователь Приложения обязан:
              {"\n"}7.1.1. соблюдать требования законодательства Республики Казахстан, при использования Приложения;
              {"\n"}7.1.2. предоставлять при регистрации достоверные, полные и актуальные данные, следить за их актуализацией;
              {"\n"}7.1.3. не предоставлять доступ другим Пользователям к собственному Личному кабинету или к отдельной содержащейся на ней информации в случае, если это может привести к нарушению д законодательства Республики Казахстан и/или интересов  Администрации.
              {"\n"}7.2. Используя ресурсы и сервисы Приложения, Пользователь Приложения вправе:
              {"\n"}7.2.1. изменять и/или дополнять регистрационные данные;
              {"\n"}7.2.2. обращаться в Администрацию по удалению персональных данных.
              {"\n"}
              {"\n"}8. Меры по защите информации о Пользователях
              {"\n"}8.1.  Администрация Приложения будет обеспечивать защиту информации о Пользователе от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий.
              {"\n"}
              {"\n"}9. Ограничение действия Политики
              {"\n"}9.1. Действие настоящей Политики не распространяется на действия и Интернет-ресурсы третьих лиц.
              {"\n"}9.2. Администрация Приложения не несет ответственности за действия третьих лиц, получивших в результате использования Интернета доступ к информации о Пользователе, за последствия использования информации, которая доступна любому пользователю сети Интернет.
              {"\n"}
              {"\n"}10. Обратная связь
              {"\n"}10.1. Предложения и/или вопросы по настоящей Политике следует направлять на электронный адрес: app@khabar.kz либо по адресу: Республика Казахстан, город Нур-Султан, район «Есиль», улица Д. Кунаева 4.
              </Text>
            :
              <Text style={[
              styles.contentText,
              this.state.selectedTheme == 'night' ? { color: themes.night.uiText } : { color: themes.normal.uiText },
            ]}>
              «Хабар» Агенттігі» акционерлік қоғамы (бұдан әрі - Әкімшілік) «Хабар 24» мобильдік қосымшасының (бұдан әрі - Қосымша) заңды құқық иеленушісі болып табылады және әрбір қалаған Пайдаланушыға Қосымшаны пайдалануға мүмкіндік береді.
              Осы «Хабар 24» Мобильдік қосымшасының құпиялылық саясаты (бұдан әрі - Саясат) осы Қосымшаны пайдалану кезінде Пайдаланушы туралы Әкімшілік ала алатын барлық ақпаратқа қатысты әрекет етеді.
              Қосымшаны пайдалану Пайдаланушының осы Саясатпен және онда көрсетілген оның жеке ақпаратын өңдеу шарттарымен сөзсіз келісімін білдіреді; осы шарттармен келіспеген жағдайда Пайдаланушы Қосымшаны пайдаланудан бас тартуы тиіс.
              Әкімшілік Қосымша Пайдаланушысының жеке ақпаратының құпиялылығының маңыздылығын мойындайды. Бұл бет Пайдаланушы Қосымшаны пайдаланғанда Әкімшілік қандай ақпаратты алатыны және жинайтыны туралы мәліметтерді қамтиды.  Пайдаланушы Қосымшаны пайдалану осы Саясатпен танысуды және келісуді автоматты түрде растайды.
              
              {"\n"}
              {"\n"}1. Терминдерді анықтау
              {"\n"}1.1 осы Құпиялылық саясатында келесі терминдер қолданылады:
              {"\n"}1.1.1. «Қосымшаның Әкімшілігі (бұдан әрі – Әкімшілік)» - дербес деректерді өңдеуді ұйымдастыратын және (немесе) жүзеге асыратын, сондай-ақ дербес деректерді өңдеу мақсаттарын, өңдеуге жататын дербес деректердің құрамын, дербес деректермен жасалатын іс-әрекеттерді (операцияларды) айқындайтын қосымшаны басқаруға уәкілетті қызметкерлер.
              {"\n"}1.1.2. «Дербес деректер» - тікелей немесе жанама анықталған немесе айқындалатын жеке тұлғаға (дербес деректер субъектісіне) қатысты кез келген ақпарат.
              {"\n"}1.1.3. «Дербес деректерді өңдеу» - дербес деректерді жинауды, жазуды, жүйелеуді, жинақтауды, сақтауды, нақтылауды (жаңартуды, өзгертуді), алуды, пайдалануды, беруді (таратуды, ұсынуды, қол жеткізуді), иесіздендіруді, бұғаттауды, жоюды қоса алғанда, автоматтандыру құралдарын пайдалана отырып немесе мұндай құралдарды пайдаланбай жасалатын кез келген іс-әрекет (операция) немесе әрекеттер (операциялар) жиынтығы.
              {"\n"}1.1.4. «Дербес деректердің құпиялылығы» - Оператордың немесе дербес деректерге рұқсат алған өзге де тұлғаның сақтауы үшін міндетті түрде дербес деректер субъектісінің келісімінсіз олардың таратылуына немесе өзге де заңды негіздеменің болуына жол бермеу талабы
              {"\n"}1.1.5. Пайдаланушы - Қосымшаны мақсаты бойынша пайдаланатын жеке тұлға немесе ұйым

              {"\n"}
              {"\n"}2. Жалпы ережелер
              {"\n"}2.1. Осы мәтін ресми құжат болып табылады және Қосымшаны және оның сервистерін пайдаланатын жеке тұлғалардың (бұдан әрі — Пайдаланушылар) ақпаратын өңдеу және қорғау тәртібін айқындайды.
              {"\n"}2.2. Осы Саясаттың мақсаты Пайдаланушылар туралы ақпаратты, оның ішінде олардың дербес деректерін рұқсатсыз қол жеткізуден және жария етуден тиісінше қорғауды қамтамасыз ету болып табылады.
              {"\n"}2.3. Қосымшаның Пайдаланушылары туралы ақпаратты жинаумен, сақтаумен, таратумен және қорғаумен байланысты қатынастар осы Саясатпен, Қосымшаның Әкімшілігі белгілеген өзге ережелермен және Қазақстан Республикасының заңнамасымен реттеледі.
              {"\n"}2.4. Осы Саясат тек Қосымшаға және Қосымша арқылы жиналатын ақпаратқа қолданылады. Ол  ешқандай басқа Қосымшаларға таралмайды және Қосымшаға сілтеме жасалуы мүмкін үшінші тараптың веб-қосымшаларына қолданылмайды.
              {"\n"}2.5. Қосымшаны пайдалана отырып, Пайдаланушы осы Құпиялылық саясатының шарттарына өз келісімін білдіреді.
              {"\n"}2.6. Пайдаланушы осы Құпиялылық саясатының шарттарымен келіспеген жағдайда, Қосымшаны және оның қызметтерін пайдалану дереу тоқтатылуы тиіс.
              {"\n"}
              {"\n"}3. Қосымшаны пайдалану шарттары
              {"\n"}3.1. Қосымшаны және оның сервистерін пайдалану мүмкіндігін бере отырып, Қосымша әкімшілігі ақылға қонымды және адал әрекет ете отырып, Пайдаланушы:
              {"\n"}- осы Қосымшаны пайдалануды жүзеге асыруға мүмкіндік беретін барлық қажетті құқықтарға ие;
              {"\n"}- Қосымшаны және оның сервистерін пайдалану үшін қажетті көлемде өзі туралы шынайы ақпаратты көрсетеді;
              {"\n"}- құпиялылық саясатымен өз келісімін білдіреді және көрсетілген құқықтар мен міндеттерді өзіне қабылдайды деп санайды.
              
              {"\n"}3.2. Қосымша әкімшілігі Пайдаланушылар алдындағы міндеттемелерді Қосымша әкімшілігі орындау мақсатында осындай тексеру қажет болған жағдайларды қоспағанда, Пайдаланушылар туралы алынатын (жиналатын) ақпараттың дұрыстығын тексермейді.
              {"\n"}
              {"\n"}4. Ақпаратты өңдеу мақсаттары
              {"\n"}4.1.Қосымша әкімшілігі Бағдарлама шарттарын іске асыру және Бағдарламаны ұйымдастырушының Пайдаланушылар алдындағы міндеттемелерін орындау мақсатында Пайдаланушылар туралы ақпаратты, оның ішінде олардың дербес деректерін өңдеуді жүзеге асырады.
              {"\n"}4.2. Қосымшадағы Пайдаланушының жеке ақпаратын Әкімшілік келесі мақсаттарда пайдалана алады:
              {"\n"}4.2.1. Қосымшаны пайдалану шеңберінде тараптың идентификациясы;
              {"\n"}4.2.2. пайдаланушыға дербестендірілген сервистерді ұсыну;
              {"\n"}4.2.3. пайдаланушымен байланыс, оның ішінде сервистерді пайдалануға, қызмет көрсетуге қатысты хабарламалар, сұрау салулар мен ақпараттар жіберу, сондай-ақ Пайдаланушыдан сұрау салулар мен өтінімдерді өңдеу;
              {"\n"}4.2.4. Қосымшаның сапасын, оны пайдаланудың қолайлылығын жақсарту, жаңа сервистер мен қызметтерді әзірлеу;
              {"\n"}
              {"\n"}5. Пайдаланушылар туралы ақпарат құрамы
              {"\n"}5.1. Пайдаланушыны сәйкестендіру үшін қажетті ақпарат. Бағдарлама шеңберінде Пайдаланушыны сәйкестендіру және коммуникацияны жүзеге асыру мақсатында Ққосымша әкімшілігі Бағдарламаға қатысатын Пайдаланушының ұялы телефонының нөмірін пайдаланады.
              {"\n"}5.2. Пайдаланушылар туралы басқа ақпарат. Қосымша әкімшілігі, сондай-ақ, Пайдаланушылар туралы басқа да ақпаратты өңдейді:
              {"\n"}5.2.1. Пайдаланушының Қосымшадағы іс-әрекеттері нәтижесінде алынған ақпарат. Пайдаланушы туралы бұл ақпарат тек Пайдаланушының өзіне, сондай-ақ Пайдаланушы рейтингіне қатысудан басқа, Қосымша Әкімшілігіне қол жетімді болуы мүмкін.
              {"\n"}
              {"\n"}6. Пайдаланушылардың жеке деректерін өңдеу
              {"\n"}6.1. Дербес деректерді өңдеу қағидаттар негізінде жүзеге асырылады:
              {"\n"}а) дербес деректерді өңдеу мақсаттары мен тәсілдерінің заңдылықтары;
              {"\n"}б) адалдық;
              {"\n"}в) дербес деректерді өңдеу мақсаттарының дербес деректерді жинау кезінде алдын ала айқындалған және мәлімделген мақсаттарға, сондай-ақ қосымша Әкімшілігінің өкілеттіктеріне сәйкес келуі;
              {"\n"}г) өңделетін дербес деректердің көлемі мен сипатының, дербес деректерді өңдеу тәсілдерінің дербес деректерді өңдеу мақсаттарына сәйкестігі.
              {"\n"}6.1.1. Дербес деректерді өңдеу шарттары мен мақсаттары
              Қосымша әкімшілігі Бағдарламаның шарттарын және Бағдарламаны ұйымдастырушының Пайдаланушылар алдындағы міндеттемелерін орындау мақсатында Пайдаланушының дербес деректерін өңдеуді жүзеге асырады.
              Пайдаланушы Бағдарлама Әкімшілігіне Бағдарламаны іске асыру шеңберінде және мақсатында өзінің дербес деректерін сақтау және өңдеу құқығын береді.
              Бағдарламаға қатыса отырып, қатысушы Пайдаланушы Операторға зерттеу жүргізу мақсатында, сондай-ақ әртүрлі байланыс құралдарының көмегімен тікелей байланысты жүзеге асыру жолымен Оператор қызметтерін жылжыту үшін өзі көрсеткен өзінің дербес деректерін өңдеуге келісім білдіреді және рұқсат береді.
              {"\n"}6.1.2. Дербес деректерді сақтау және пайдалану
              Пайдаланушылардың дербес деректері тек қана электрондық тасығыштарда сақталады және заңнама талаптарын орындауға байланысты дербес деректерді автоматтандырылмаған өңдеу қажет болған жағдайларды қоспағанда, автоматтандырылған жүйелерді пайдалана отырып өңделеді.
              {"\n"}6.1.3. Дербес деректерді беру
              Бағдарлама ережелерінде және Құпиялылық саясатында тікелей көзделген жағдайларды қоспағанда, Пайдаланушылардың дербес деректері қандай да бір үшінші тұлғаларға берілмейді.
              Пайдаланушыны көрсеткен кезде немесе Пайдаланушының келісімі болған кезде Пайдаланушының жеке деректерін үшінші тұлғаларға - Бағдарлама Әкімшілігінің серіктестеріне осындай серіктестердің алынған ақпараттың құпиялылығын қамтамасыз ету жөніндегі міндеттемелерді қабылдауы шартымен және Бағдарлама шарттарын орындау мақсатында ғана беруге болады.
              Мемлекеттік органдардың (жергілікті өзін-өзі басқару органдарының) сұрау салуы бойынша Пайдаланушылардың дербес деректерін ұсыну заңнамада көзделген тәртіппен жүзеге асырылады.
              {"\n"}6.1.4. Дербес деректерді жою
              Пайдаланушының жеке деректері:
              {"\n"}- Пайдаланушының талабы бойынша Пайдаланушының жеке деректерін Қосымша әкімшілігі жояды
              {"\n"}- Пайдаланушы профилін Қосымша әкімшілігі жояды.
              {"\n"}
              {"\n"}7. Пайдаланушылардың құқықтары мен міндеттері
              {"\n"}7.1. Қосымша ресурстары мен сервистерін пайдалана отырып, Қосымша Пайдаланушысы міндетті:
              {"\n"}7.1.1. Қазақстан Республикасының қолданыстағы заңнамасының, осы Ереженің және әкімшіліктің құқықтық сипаты бар өзге де құжаттарының ережелерін сақтау;
              {"\n"}7.1.2. тіркеу кезінде шынайы, толық және өзекті деректерді ұсыну, олардың өзектілігін қадағалау;
              {"\n"}7.1.3. егер бұл Қазақстан Республикасының қолданыстағы заңнамасын және/немесе осы Ережені, әкімшіліктің өзге де құқықтық актілерін бұзуға әкеп соқтыруы мүмкін болса, басқа Пайдаланушыларға жеке кабинетке немесе ондағы жеке ақпаратқа қол жеткізбеу;
              {"\n"}
              {"\n"}8. Пайдаланушылар туралы ақпаратты қорғау шаралары
              {"\n"}8.1. Қосымша әкімшілігі Пайдаланушы туралы ақпаратты заңсыз немесе кездейсоқ қол жеткізуден, жоюдан, өзгертуден, бұғаттаудан, көшіруден, таратудан, сондай-ақ өзге де заңсыз әрекеттерден қорғауды қамтамасыз ететін болады.
              {"\n"}
              {"\n"}9. Саясаттың қолданылуын шектеу
              {"\n"}9.1. Осы Саясаттың әрекеті үшінші тұлғалардың әрекеттері мен Интернет-ресурстарына қолданылмайды.
              {"\n"}9.2. Қосымша Әкімшілігі Интернетті пайдалану нәтижесінде Пайдаланушы туралы ақпаратқа қол жеткізе алған үшінші тұлғалардың әрекеттері үшін, Интернет желісінің кез келген пайдаланушысына қол жетімді ақпаратты пайдалану салдары үшін жауапты болмайды.
              {"\n"}
              {"\n"}10. Кері байланыс
              {"\n"}10.1. Осы Саясатқа қатысты ұсыныстарды және/немесе мәселелерді app@khabar.kz электрондық адресіне немесе Қазақстан Республикасы, Нұр-Сұлтан қаласы, «Есіл» ауданы, Д. Қонаев көшесі, 4 мекен-жайына жіберу керек.
              </Text>
            }
            <UiClearCard />
          </ScrollView>
        </SafeAreaView>

        <Loader selectedTheme={this.state.selectedTheme} show={this.state.loginProgress} />
      </View>
    );
  }
}


const styles = StyleSheet.create({
  container: {
    flex: 1,
  },
  safeArea: {
    flex: 1,
  },
  content: {
    flex: 1,
    marginVertical: 8,
  },
  contentText: {
    fontFamily: 'Roboto-Regular',
    fontSize: 14,
    lineHeight: 16,
    marginVertical: 12,
    marginHorizontal: 16,
    textAlign: 'justify',
  },
  textBold: {
    fontFamily: 'Roboto-Medium',
  },

});
