export const kz = {
    search_by_news: "Хабар 24 жаңалықтарын іздеу",
    search_by_tv: "Хабар 24 тележобаларын іздеу",

    date_january_s: "қаңтардың",
    date_february_s: "ақпанның",
    date_march_s: "науырыздың",
    date_april_s: "сәуірдің",
    date_may_s: "мамырдың",
    date_june_s: "маусымның",
    date_july_s: "шілденің",
    date_august_s: "тамыздың",
    date_september_s: "қыркүйектің",
    date_october_s: "қазанның",
    date_november_s: "қарашаның",
    date_december_s: "желтоқсанның",

    date_january: "қаңтар",
    date_february: "ақпан",
    date_march: "науырыз",
    date_april: "сәуір",
    date_may: "мамыр",
    date_june: "маусым",
    date_july: "шілде",
    date_august: "тамыз",
    date_september: "қыркүйек",
    date_october: "қазан",
    date_november: "қараша",
    date_december: "желтоқсан",

    monday_short: "дс",
    tuesday_short: "сс",
    wednesday_short: "ср",
    thursday_short: "бс",
    friday_short: "жм",
    saturday_short: "сн",
    sunday_short: "жс",

    yesterday: "Кеше",
    today: "Бүгін",
    tomorrow: "Ертең",

    stay_informed: "Хабардар болыңыз",
    stay_informed_subtitle: "Push-хабарлама функциясы Сізге арналған",
    offline_mode: "Оффлайн режимі",
    offline_mode_activ: "Офлайн режимде қосу",
    offline_mode_subtitle: "Желіден тыс оқу үшін жаңалықтар парағын жүктеңіз",
    selected_articles: 'Іріктелген мақалалар',
    selected_articles_subtitle: 'Мақалаларды кейінірек оқу үшін сақтаңыз',
    reminding: "Еске салу",
    reminding_subtitle: "Телебағдарлама көруді өткізіп алмау туралы хабарландыру орнатыңыз",
    night_mode: "Түнгі режим",
    night_mode_subtitle: "Түнгі режимде жаңалықтарды көру",

    news: "Жаңалықтар",
    news_habar24: "Хабар 24 жаңалықтардың бағдарламасы",
    card_news_title_drive: "Драйв| Жолаушылар көлігін өндіру процесі",

    wrong_date: "Қате деректер",
    fill_input: "Жолды толтырыңыз",

    save: "Сақтау",

    latest_news: "Жаңа",
    my_news: "Менің жаңалықтарым",
    popular: "Танымал",
    headings: "Айдарлар",
    tv_projects: "Тележобалар",

    yes: "Иә",
    cancel: "Жою",

    drop_text: "Лақтыру",

    choice_of_subject: "Бастау",
    customize_headings: "Айдарларды реттеу",

    habar24: "Басты",
    tv_projects_spec: "TV-жоба",
    tv_programm: "Бағдарлама",
    reporter: "Сен - Репортерсің",
    more: "Тағы",

    contact_us_text: "Сізді толғандырған тақырып бойынша өз пікіріңізді білдіріңіз",
    theme: "Тақырып",
    message: "Хабарлама",

    data_create_channel: "Алғаш рет эфирге 2012 жылдың 1 қыркүйегінен бастап  «24 KZ» атауымен шыққан арна 2016 жылдың 1 қыркүйегінде «Хабар 24» болып өзгертілді. Құрамындағы «24 KZ» арнасының атын ауыстыру – «Хабар» агенттігінің қайта жаңару аясындағы шараларының бірі әрі арнаның агенттіктің телеотбасындағы мүшесі екендігін айқындау. ",  
    info_message_about_channel1: "Жаңа телемаусымды жаңа атпен бастаған арна эфирінде сапалы сараптамалық бағдарламалардың қатары ұлғайып, репортаж жанрындағы бағдарламалардың үлесі артты, сондай-ақ аймақтардың тыныс-тіршілігі туралы жобалар көбейді.",
    info_message_about_channel2: "Арнаның дәстүрлі айдарларында экономика, спорт, халықаралық және баспасөзге шолу, арнайы авторлық репортаждар және көптеген басқа да салалар толығырақ қамтылады. Арнадағы бағдарламалар 100% отандық өндірушілердің жобалары болып табылады.",
    info_message_about_channel3: "Телеарна аудиториясын 25 жастан асқан көрермендер құрайды. «Хабар» агенттігі «Хабар 24» арнасымен бірге Euronews Network-тің серіктесі болып табылады. Бұл жаңалықтар контентімен алмасуға және еуропалық әріптестерімен шеберлік сабақтарын өткізуге мүмкіндік береді.",
    info_message_about_channel4: "Аймақтық тілшілер желісі: ",
    info_message_about_channel5: "Ақтау, Ақтөбе, Атырау, Көкшетау, Қарағанды, Қостанай, Қызылорда, Орал, Өскемен, Павлодар, Петропавл, Семей, Талдықорған, Тараз,  Шымкент, Түркістан.",
    info_message_about_channel6: "Халықаралық тілшілер желісі: ",
    info_message_about_channel8: "АҚШ, Бельгия, Германия, Түркия, Ресей, Қытай, Оңтүстік Корея, Өзбекстан.",
    contacts: "Байланыс: ",
    contacts_1: "010000, Нұр-Сұлтан қаласы, Қонаев көшесі, 4 үй",
    contacts_2: "Жаңалықтар бөлімі: +7 (7172) 757 485",
    contacts_3: "Бағдарламалар бөлімі: +7 (7172) 757 647",
    contacts_4: "Маркетинг және даму жөніндегі департамент: +7 (7172) 757 554",

    comment_about_habar24:"«Хабар 24» қосымшасы туралы пікіріңізді бөліскіңіз келгеніне рахмет! Сізді не мазалайтынын жазыңыз. Біз сұрақтарыңызға және түсініктемелеріңізге жауап беруге тырысамыз.",

    no_title: "Тақырыптар таңдалмаған",
    choice_of_subject_for_you: "Жеке жинақ жасау үшін тақырыптарды таңдаңыз",

    read_later: "Кейінірек оқу",
    read_later_add: "Сіз жаңалықты КЕЙІНІРЕК ОҚУ бөліміне қостыңыз. Сіз оны ТАҒЫ қойындысынан таба аласыз.",

    active_offline_mode: "Оффлайн режимін косу?",
    message_offline_mode: "Жаңалықтар Жаңа және Менің жаңалықтарым парақшалардан жүктелетін болады.",
    message_offline_mode2: "Жүктеу Wi-Fi және ұялы желі арқылы асырылады. Видео жүктелмейді.",

    news_release: "Жаңалықтар шығарылымы",
    news_time_ago: "бұрын",
    news_title_production: "Развиваем пищевую промышленность Казахстана | Промышленность",
    news_production_text1: "В посёлке Солнечный прозвенел первый звонок в новой школе. Её построили за короткие сроки, чтобы успеть подарить детям на День знаний, сообщает корреспондент «Хабар 24».",
    news_production_text2: "- В новой школе для учащихся на государственном языке поселок Солнечный нуждался давно. Немного углублюсь в историю. 24 года назад здесь отмечали 150-летие Абая Кунанбаева. Тогда местные жители попросили открыть в поселке казахскоязычную школу. Было решено выделить пустующее здание бывшего детского сада, где педколлективу пришлось приспосабливаться к тесным помещениям. И вот спустя почти четверть века в поселке построили эту школу. Стоимость проекта превысила миллиард двести миллионов тенге. Строители сдали объект «под ключ». Школу укомплектовали всем необходимым оборудованием и по последнему слову техники.",
    news_production_text3: "Авторы: Е. Абишев, С. Оспанов, А.Омельницкий",

    bulb: "Пайдаланушы нұсқаулығы",
    mobile: "Бізбен байланысыңыз",
    link_with_moderate: "Редакциямен байланысу",
    rating: "Қосымшаны бағалау",
    share: "Бөлісу",
    politics: "Құпиялық саясаты",

    language_kz: "Қазақ тілі",

    no_record: "Жазбалар қосылмаған",
    no_record_text: "Сіз КЕЙІНІРЕК ОҚУ бөліміне ешқандай жазба қосқан жоқсыз",

    settings_push: "Push-хабарламаны реттеу",
    push: "Push-хабарлама",
    push_uppercase: "Push-хабарлама",

    text_size: "Мәтіннің өлшемі",
    text_size_modify: "Мәтін көлемін өзгерту үшін құрылғының бастапқы бетінен жалпы параметрлер бөліміне өтіңіз:",
    text_size_bread_crumb: "Параметрлер → Экран және жарықтылық → Мәтін өлшемі",

    read_later_uppercase: "КЕЙІНІРЕК ОҚУ",
    settings_uppercase: "ҚҰРЫЛҒЫНЫ РЕТТЕУ",
    change_language_uppercase: "ТІЛДІ ТАҢДАУ",
    about_kz24_uppercase: "«Хабар 24» туралы",
    about_app_uppercase: "Қосымша туралы",

    community_reporter: "Сен-Репортерсің",
    contact_phone: "Байланыс телефоны",
    enter_phone: "Телефон номерін еңгізіңіз",
    enter_title: "Тақырыпты еҢгізіңіз",
    enter_about: "Сипаттаманы еңгізіңіз",
    load: "Жүктеу",
    date_time: "Күні мен уақыты",

    news_title: "Жаңалықтын тақырыбы",
    news_about: "Жаңалықтың сипаттамасы",
    photo_and_video: "Фото және видео материалдар",
    min_size: "Фотоның мөлшері 2Мб аспау керек",
    max_size: "Жалпы файлдардың мөлшері 20Мб аспауы керек",
    no_read_label: "Мен жаңалықтар мазмұнына жауап беремін",
    send: "Жіберу",

    tv_programm_header: "Телебағдарлама",
    create_notification: "Хабарлама жасау керек пе?",
    create_notification_text: "Таңдалған телебағдарлама бойынша хабарлама жасағыңыз келетініне сенімдісіз бе?",
    notification_time: "Мені хабарландыру",
    notification_time_5m: "5 минут бұрын",
    notification_time_15m: "15 минут бұрын",
    notification_time_30m: "30 минут бұрын",
    notification_time_60m: "Бір сағат бұрын",

    title: "Тақырып",
    hours_late: "сағат бұрын",
    comment: "Сипаттама",

    login: "Кіру",
    language_app: "Қолдану тілі",

    not_found: "Табылмады",
    not_found_text: "Іздеудің нәтижесі жоқ",

    no_title2: "Темы не Найденны",
    
    add_cat: "Таңдалған",
    rem_cat: "Қосу",

    
    reset_news: "Абайлаңыз",
    reset_news_mode: "Сіз оқуды жалғастыра аласыз",

    time_mm: "мин",
    time_hh: "сағат",

    connect_off: "Теледидар бағдарламасы қол жетімді емес",
    connect_off_news: "Жаңалықтар жоқ Интернетке қосылғаныңызды тексеріп, бетті жаңартыңыз. ",
    connect_off_text: "Интернет қосылымыңызды тексеріп, бетті жаңартыңыз",
    connect_off_news_text: "қолжетімсіз Интернетке қосылғаныңызды тексеріп, бетті қайта жаңартыңыз",
}

