 
export const ru  = {
    search_by_news: "Поиск по новостям..",
    search_by_tv: "Поиск по телепроектам..",

    date_january_s: "января",
    date_february_s: "февраля",
    date_march_s: "марта",
    date_april_s: "апреля",
    date_may_s: "мая",
    date_june_s: "июня",
    date_july_s: "июля",
    date_august_s: "августа",
    date_september_s: "сентября",
    date_october_s: "октября",
    date_november_s: "ноября",
    date_december_s: "декабря",

    date_january: "январь",
    date_february: "февраль",
    date_march: "март",
    date_april: "апрель",
    date_may: "май",
    date_june: "июнь",
    date_july: "июль",
    date_august: "август",
    date_september: "сентябрь",
    date_october: "октябрь",
    date_november: "ноябрь",
    date_december: "декабрь",

    monday_short: "пн",
    tuesday_short: "вт",
    wednesday_short: "ср",
    thursday_short: "чт",
    friday_short: "пт",
    saturday_short: "сб",
    sunday_short: "вс",

    yesterday: "Вчера",
    today: "Сегодня",
    tomorrow: "Завтра",

    stay_informed: "Оставайтесь в курсе",
    stay_informed_subtitle: "Для Вас предназначена функция Push-уведомлений",
    offline_mode: "Режим оффлайн",
    offline_mode_activ: "Активация режима оффлайн",
    offline_mode_subtitle: "Скачайте страницу новостей для чтения оффлайн",
    selected_articles: 'Избранные статьи',
    selected_articles_subtitle: 'Закрепите статьи, чтобы прочесть их позднее',
    reminding: "Напоминания",
    reminding_subtitle: "Поставьте уведомление, чтобы не пропустить просмотр",
    night_mode: "Ночной режим",
    night_mode_subtitle: "Комфортный просмотр новостей в ночном режиме",

    news: "Новости",
    news_habar24: "Программа новостей Хабар24",
    card_news_title_drive: "Процесс производства пассажирского транспорта | Драйв",

    wrong_date: "Неверные данные",
    fill_input: "Заполните поле",

    save: "Сохранить",

    latest_news: "Свежие Новости",
    my_news: "Мои новости",
    popular: "Популярное",
    headings: "Рубрики",
    tv_projects: "Телепроекты",

    yes: "Да",
    cancel: "Отмена",

    drop_text: "Сбросить",

    choice_of_subject: "Выбрать темы",
    customize_headings: "Настройки рубрик",

    habar24: "Главная",
    tv_projects_spec: "TV-Проекты",
    tv_programm: "Программа",
    reporter: "Ты-Репортер",
    more: "Ещё",

    contact_us_text: "Какая бы тема Вас не волновала - выскажите свое мнение.",
    theme: "Тема",
    message: "Сообщение",

    data_create_channel: "1 сентября 2016 года первый круглосуточный информационный канал Казахстана «24KZ» вышел в эфир под новым названием «Хабар 24». Смена названия – одно из мероприятий в рамках трансформации АО «Агентство «Хабар», частью которого телеканал «24KZ» является с момента создания.",  
    info_message_about_channel1: "Эфир канала пополнился рядом качественных аналитических программ, увеличилась доля программ репортажного формата и передач о жизни регионов. В новостях, на которых специализируется канал, усилились традиционные сегменты: экономический, спортивный и международный обзоры, обзор прессы, специальные авторские репортажи и многое другое.",
    info_message_about_channel2: "Использование единого названия распространено среди крупных медиахолдингов для обозначения принадлежности канала к определенному телесемейству, например, корпорация BBC с каналами BBC One, BBC Two, BBC World News и другие, ВГТРК с каналами Россия 24, Россия 1, Россия К и другие.",
    info_message_about_channel3: "Телеканал «24KZ» был запущен 1 сентября 2012 года. Канал обладает самой обширной региональной и международной корреспондентской сетью среди информационных каналов в Казахстане. В эфире «Хабар 24» - 100% программ отечественного производства, среди которых информационно-познавательные и аналитические передачи. Аудиторию канала составляют зрители от 25 лет. Агентство «Хабар» вместе с каналом «Хабар 24» являются партнерами «Euronews Network», что предоставляет возможности обмениваться новостным контентом и посещать мастер-классы европейских коллег.",
    info_message_about_channel4: "Региональная корсеть:  ",
    info_message_about_channel5: "Актау, Актобе, Атырау, Караганда, Кокшетау, Костанай, Кызылорда, Павлодар, Петропавловск, Семей, Талдыкорган, Тараз, Уральск, Усть-Каменогорск, Шымкент, Туркестан.",
    info_message_about_channel6: "Международная корсеть:",
    info_message_about_channel8: "США, Бельгия, Германия, Турция, Россия, Китай, Южная Корея, Узбекистан.",
    info_message_about_channel9: "Каждые сутки канал выдает в эфир 24 выпуска программы «Новости».",
    contacts: "Наши контакты:",
    contacts_1: "010000, г.Нур-Султан, ул.Конаева, д.4",
    contacts_2: "Отдел новостей телеканала «Хабар 24»: +7 (7172) 757 485 ",
    contacts_3: "Программный отдел телеканала «Хабар 24»: +7 (7172) 757 647 ",
    contacts_4: "Департамент маркетинга и развития: +7 (7172) 757 554",

    comment_about_habar24:"Спасибо, что хотите поделиться Вашим комментарием о приложении «Хабар 24»! Напишите, что Вас беспокоит ниже. Мы постараемся ответить на Ваши вопросы и замечания.",

    no_title: "Темы не выбраны",
    choice_of_subject_for_you: "Выберите темы для создания вашей персональной ленты",

    read_later: "Прочесть позднее",
    read_later_add: "Вы добавили новость в раздел ПРОЧЕСТЬ ПОЗДНЕЕ. Вы найдете её во вкладке Ещё",

    active_offline_mode: "АКТИВИРОВАТЬ РЕЖИМ ОФФЛАЙН?",
    message_offline_mode: "Будет произведена загрузка новостей со страниц Свежее и Мои новости.",
    message_offline_mode2: "Загрузка производится как по Wi-Fi? так и по мобильной сети. Видео не загружается.",

    news_release: "Выпуски новостей",
    news_time_ago: "назад",
    news_title_production: "Развиваем пищевую промышленность Казахстана | Промышленность",
    news_production_text1: "В посёлке Солнечный прозвенел первый звонок в новой школе. Её построили за короткие сроки, чтобы успеть подарить детям на День знаний, сообщает корреспондент «Хабар 24».",
    news_production_text2: "- В новой школе для учащихся на государственном языке поселок Солнечный нуждался давно. Немного углублюсь в историю. 24 года назад здесь отмечали 150-летие Абая Кунанбаева. Тогда местные жители попросили открыть в поселке казахскоязычную школу. Было решено выделить пустующее здание бывшего детского сада, где педколлективу пришлось приспосабливаться к тесным помещениям. И вот спустя почти четверть века в поселке построили эту школу. Стоимость проекта превысила миллиард двести миллионов тенге. Строители сдали объект «под ключ». Школу укомплектовали всем необходимым оборудованием и по последнему слову техники.",
    news_production_text3: "Авторы: Е. Абишев, С. Оспанов, А.Омельницкий",

    bulb: "Руководство пользователя",
    mobile: "Свяжитесь с нами",
    link_with_moderate: "Связаться с редакцией",
    rating: "Оценить приложение",
    share: "Поделиться",
    politics: "Политика конфиденциальности",

    language_kz: "Казахский",

    no_record: "Записи не добавлены",
    no_record_text: "Вы не добавили ни одну запись в раздел ПРОЧЕСТЬ ПОЗДНЕЕ",

    settings_push: "Настройка push-уведомлений",
    push: "Push-уведомления",
    push_uppercase: "Push-уведомления",

    text_size: "Размер текста",
    text_size_modify: "Чтобы увеличить или уменьшить размер текста в этом приложении, перейдите в раздел общих настроек со стартовой страницы Вашего устройства:",
    text_size_bread_crumb: "Настройки -> Экран и яркость -> Размер текста",

    read_later_uppercase: "ПРОЧЕСТЬ ПОЗДНЕЕ",
    settings_uppercase: "НАСТРОЙКИ",
    change_language_uppercase: "СМЕНА ЯЗЫКА",
    about_kz24_uppercase: "O «Хабар 24» ",
    about_app_uppercase: "О приложении",

    community_reporter: "Народный репортер",
    contact_phone: "Контактный телефон",
    enter_phone: "Введите телефон..",
    enter_title: "Введите заголовок..",
    enter_about: "Введите описание..",
    load: "Загрузить",
    date_time: "Дата и время",

    news_title: "Заголовок новости",
    news_about: "Описание новости",
    photo_and_video: "Фото и видеоматериалы",
    min_size: "Размер фотографий не более 2Мб",
    max_size: "Общий размер файлов не более 20Мб",
    no_read_label: "Я несу ответственность за содержание новости",
    send: "Отправить",

    tv_programm_header: "Телепрограмма",
    create_notification: "Создать уведомление?",
    create_notification_text: "Вы уверены, что хотите создать уведомление о выбранной телепередаче?",
    notification_time: "Уведомить меня за:",
    notification_time_5m: "За 5 минут",
    notification_time_15m: "За 15 минут",
    notification_time_30m: "За 30 минут",
    notification_time_60m: "За час до начала",

    title: "Заголовок",
    hours_late: "часов назад",
    comment: "Описание",

    login: "Войти",
    language_app: "Язык приложения",

    not_found: "Не найдено",
    not_found_text: "Поиск не дал результатов",

    no_title2: "Темы не Найдены",
    
    add_cat: "Добавить",
    rem_cat: "Выбранные",

    reset_news: "Внимание",
    reset_news_mode: "Вы можете продолжить чтение",

    time_mm: "мин.",
    time_hh: "ч.",

    connect_off: "Телепрограмма недоступна",
    connect_off_news: "Новостей нет",
    connect_off_text: "Проверьте интернет соединение и обновите страницу",
    connect_off_news_text: "Проверьте интернет соединение и перезагрузите страницу",
}   